#+title:     Ectorepo: FRC
#+author:    David Conner
#+email:     noreply@te.xel.io

A list of repositories related to the FRC robotics competitions.

When using =repo init -u $url -m $manifest= instead of the git submodule to
checkout, the filepaths for =<include name=mnfst.xml/>= are relative to the root
repository.

#+begin_src xml :tangle default.xml
<?xml version="1.0" encoding="utf-8"?>
<manifest>
  <include name="_remotes.xml"/>
  <default remote="github" sync-j="8" revision="refs/heads/master"/>
  <include name="frc/wpilibsuite.xml"/>
  <include name="frc/frcmisc.xml"/>
</manifest>
#+end_src

Check rates:

#+begin_src emacs-lisp :results value code :exports code
(ghub-graphql-rate-limit)
#+end_src

To avoid confirmations

#+begin_src emacs-lisp
(setq-local org-confirm-babel-evaluate nil)
#+end_src

* Setup

#+name: nrepos
#+begin_src emacs-lisp
100
#+end_src

#+RESULTS: nrepos
: 100

*  Core

* Misc

The paths for the repositories here will change as I become more familiar with
the FRC ecosystem.


Generate =wpilibsuite.xml=

#+begin_src xml :tangle frcmisc.xml :noweb yes
<?xml version="1.0" encoding="utf-8"?>
<manifest>
  <!-- robotpy -->
  <project name="robotpy/pynetworktables" path="robotpy/pynetworktables" revision="refs/heads/main" remote="github" />
</manifest>
#+end_src

* WPI Lib

Get about 60 of the =wpilibsuite= repositories. These should go into
=/data/ecto/frc/wpilibsuite=.

#+name: wpi-repos
#+begin_src emacs-lisp :var nrepos=60 :results replace vector value :exports code :noweb yes
(ghub-graphql
 (graphql-query ((organization
                  :arguments ((login . "wpilibsuite"))
                  (repositories
                   :arguments ((first . <<nrepos()>>)
                               (orderBy . ((field . UPDATED_AT)
                                           (direction . DESC))))
                   (edges
                    (node (owner login)
                          name
                          (defaultBranchRef prefix name)
                          url
                          updatedAt
                          isArchived)))))))
#+end_src

#+RESULTS: wpi-repos
| data | (organization (repositories (edges ((node (owner (login . wpilibsuite)) (name . allwpilib) (defaultBranchRef (prefix . refs/heads/) (name . main)) (url . https://github.com/wpilibsuite/allwpilib) (updatedAt . 2024-01-06T05:01:10Z) (isArchived))) ((node (owner (login . wpilibsuite)) (name . frc-docs) (defaultBranchRef (prefix . refs/heads/) (name . main)) (url . https://github.com/wpilibsuite/frc-docs) (updatedAt . 2024-01-05T02:52:58Z) (isArchived))) ((node (owner (login . wpilibsuite)) (name . dev-ops) (defaultBranchRef (prefix . refs/heads/) (name . main)) (url . https://github.com/wpilibsuite/dev-ops) (updatedAt . 2024-01-04T22:54:44Z) (isArchived))) ((node (owner (login . wpilibsuite)) (name . GradleRIO) (defaultBranchRef (prefix . refs/heads/) (name . main)) (url . https://github.com/wpilibsuite/GradleRIO) (updatedAt . 2023-12-31T20:52:42Z) (isArchived))) ((node (owner (login . wpilibsuite)) (name . sphinxext-rediraffe) (defaultBranchRef (prefix . refs/heads/) (name . main)) (url . https://github.com/wpilibsuite/sphinxext-rediraffe) (updatedAt . 2023-12-30T05:19:38Z) (isArchived))) ((node (owner (login . wpilibsuite)) (name . WPILibInstaller-Avalonia) (defaultBranchRef (prefix . refs/heads/) (name . main)) (url . https://github.com/wpilibsuite/WPILibInstaller-Avalonia) (updatedAt . 2023-12-29T19:33:24Z) (isArchived))) ((node (owner (login . wpilibsuite)) (name . deploy-utils) (defaultBranchRef (prefix . refs/heads/) (name . main)) (url . https://github.com/wpilibsuite/deploy-utils) (updatedAt . 2023-12-27T12:38:32Z) (isArchived))) ((node (owner (login . wpilibsuite)) (name . 2024Beta) (defaultBranchRef (prefix . refs/heads/) (name . main)) (url . https://github.com/wpilibsuite/2024Beta) (updatedAt . 2023-12-25T20:09:55Z) (isArchived))) ((node (owner (login . wpilibsuite)) (name . cscore) (defaultBranchRef (prefix . refs/heads/) (name . master)) (url . https://github.com/wpilibsuite/cscore) (updatedAt . 2023-12-19T17:39:15Z) (isArchived . t))) ((node (owner (login . wpilibsuite)) (name . shuffleboard) (defaultBranchRef (prefix . refs/heads/) (name . main)) (url . https://github.com/wpilibsuite/shuffleboard) (updatedAt . 2023-12-17T03:33:39Z) (isArchived))) ((node (owner (login . wpilibsuite)) (name . WPILibPi) (defaultBranchRef (prefix . refs/heads/) (name . main)) (url . https://github.com/wpilibsuite/WPILibPi) (updatedAt . 2023-12-16T22:24:53Z) (isArchived))) ((node (owner (login . wpilibsuite)) (name . frc-characterization) (defaultBranchRef (prefix . refs/heads/) (name . main)) (url . https://github.com/wpilibsuite/frc-characterization) (updatedAt . 2023-12-16T05:57:26Z) (isArchived . t))) ((node (owner (login . wpilibsuite)) (name . native-utils) (defaultBranchRef (prefix . refs/heads/) (name . main)) (url . https://github.com/wpilibsuite/native-utils) (updatedAt . 2023-12-12T17:36:24Z) (isArchived))) ((node (owner (login . wpilibsuite)) (name . xrp-wpilib-firmware) (defaultBranchRef (prefix . refs/heads/) (name . main)) (url . https://github.com/wpilibsuite/xrp-wpilib-firmware) (updatedAt . 2023-12-10T00:12:41Z) (isArchived))) ((node (owner (login . wpilibsuite)) (name . sphinxext-opengraph) (defaultBranchRef (prefix . refs/heads/) (name . main)) (url . https://github.com/wpilibsuite/sphinxext-opengraph) (updatedAt . 2023-12-09T20:24:53Z) (isArchived))) ((node (owner (login . wpilibsuite)) (name . sphinxext-pwa) (defaultBranchRef (prefix . refs/heads/) (name . main)) (url . https://github.com/wpilibsuite/sphinxext-pwa) (updatedAt . 2023-12-05T11:35:59Z) (isArchived))) ((node (owner (login . wpilibsuite)) (name . branding) (defaultBranchRef (prefix . refs/heads/) (name . main)) (url . https://github.com/wpilibsuite/branding) (updatedAt . 2023-12-04T23:12:16Z) (isArchived))) ((node (owner (login . wpilibsuite)) (name . xcode-notarize) (defaultBranchRef (prefix . refs/heads/) (name . main)) (url . https://github.com/wpilibsuite/xcode-notarize) (updatedAt . 2023-11-30T07:18:45Z) (isArchived))) ((node (owner (login . wpilibsuite)) (name . gradle-cpp-vscode) (defaultBranchRef (prefix . refs/heads/) (name . main)) (url . https://github.com/wpilibsuite/gradle-cpp-vscode) (updatedAt . 2023-11-29T06:21:10Z) (isArchived))) ((node (owner (login . wpilibsuite)) (name . sysid) (defaultBranchRef (prefix . refs/heads/) (name . main)) (url . https://github.com/wpilibsuite/sysid) (updatedAt . 2023-11-22T18:14:47Z) (isArchived . t))) ((node (owner (login . wpilibsuite)) (name . vscode-wpilib) (defaultBranchRef (prefix . refs/heads/) (name . main)) (url . https://github.com/wpilibsuite/vscode-wpilib) (updatedAt . 2023-11-22T01:27:56Z) (isArchived))) ((node (owner (login . wpilibsuite)) (name . PathWeaver) (defaultBranchRef (prefix . refs/heads/) (name . main)) (url . https://github.com/wpilibsuite/PathWeaver) (updatedAt . 2023-11-10T10:54:23Z) (isArchived))) ((node (owner (login . wpilibsuite)) (name . opencv) (defaultBranchRef (prefix . refs/heads/) (name . 4.5.4-wpilib)) (url . https://github.com/wpilibsuite/opencv) (updatedAt . 2023-11-08T04:21:51Z) (isArchived))) ((node (owner (login . wpilibsuite)) (name . Control-System-Vectors) (defaultBranchRef (prefix . refs/heads/) (name . main)) (url . https://github.com/wpilibsuite/Control-System-Vectors) (updatedAt . 2023-11-06T00:38:28Z) (isArchived))) ((node (owner (login . wpilibsuite)) (name . thirdparty-opencv) (defaultBranchRef (prefix . refs/heads/) (name . main)) (url . https://github.com/wpilibsuite/thirdparty-opencv) (updatedAt . 2023-11-01T23:24:07Z) (isArchived))) ((node (owner (login . wpilibsuite)) (name . frc-docs-translations) (defaultBranchRef (prefix . refs/heads/) (name . main)) (url . https://github.com/wpilibsuite/frc-docs-translations) (updatedAt . 2023-10-27T17:20:39Z) (isArchived))) ((node (owner (login . wpilibsuite)) (name . wpilib-ws-robot-romi) (defaultBranchRef (prefix . refs/heads/) (name . main)) (url . https://github.com/wpilibsuite/wpilib-ws-robot-romi) (updatedAt . 2023-10-21T20:34:50Z) (isArchived))) ((node (owner (login . wpilibsuite)) (name . homebrew-wpilib) (defaultBranchRef (prefix . refs/heads/) (name . master)) (url . https://github.com/wpilibsuite/homebrew-wpilib) (updatedAt . 2023-10-16T03:35:46Z) (isArchived))) ((node (owner (login . wpilibsuite)) (name . styleguide) (defaultBranchRef (prefix . refs/heads/) (name . main)) (url . https://github.com/wpilibsuite/styleguide) (updatedAt . 2023-10-10T22:14:51Z) (isArchived))) ((node (owner (login . wpilibsuite)) (name . apriltag) (defaultBranchRef (prefix . refs/heads/) (name . main)) (url . https://github.com/wpilibsuite/apriltag) (updatedAt . 2023-10-01T04:23:42Z) (isArchived))) ((node (owner (login . wpilibsuite)) (name . romi-vendordep) (defaultBranchRef (prefix . refs/heads/) (name . main)) (url . https://github.com/wpilibsuite/romi-vendordep) (updatedAt . 2023-09-29T15:43:40Z) (isArchived . t))) ((node (owner (login . wpilibsuite)) (name . gradle-jni) (defaultBranchRef (prefix . refs/heads/) (name . main)) (url . https://github.com/wpilibsuite/gradle-jni) (updatedAt . 2023-09-27T22:37:31Z) (isArchived))) ((node (owner (login . wpilibsuite)) (name . sphinxext-remoteliteralinclude) (defaultBranchRef (prefix . refs/heads/) (name . main)) (url . https://github.com/wpilibsuite/sphinxext-remoteliteralinclude) (updatedAt . 2023-09-26T08:45:52Z) (isArchived))) ((node (owner (login . wpilibsuite)) (name . node-wpilib-ws) (defaultBranchRef (prefix . refs/heads/) (name . main)) (url . https://github.com/wpilibsuite/node-wpilib-ws) (updatedAt . 2023-09-16T00:56:57Z) (isArchived))) ((node (owner (login . wpilibsuite)) (name . ni-libraries) (defaultBranchRef (prefix . refs/heads/) (name . main)) (url . https://github.com/wpilibsuite/ni-libraries) (updatedAt . 2023-09-09T11:54:32Z) (isArchived))) ((node (owner (login . wpilibsuite)) (name . docker-images) (defaultBranchRef (prefix . refs/heads/) (name . main)) (url . https://github.com/wpilibsuite/docker-images) (updatedAt . 2023-08-25T06:26:13Z) (isArchived))) ((node (owner (login . wpilibsuite)) (name . build-tools) (defaultBranchRef (prefix . refs/heads/) (name . master)) (url . https://github.com/wpilibsuite/build-tools) (updatedAt . 2023-08-19T11:24:44Z) (isArchived))) ((node (owner (login . wpilibsuite)) (name . robotbuilder-2) (defaultBranchRef (prefix . refs/heads/) (name . main)) (url . https://github.com/wpilibsuite/robotbuilder-2) (updatedAt . 2023-07-25T22:00:30Z) (isArchived))) ((node (owner (login . wpilibsuite)) (name . RobotBuilder) (defaultBranchRef (prefix . refs/heads/) (name . main)) (url . https://github.com/wpilibsuite/RobotBuilder) (updatedAt . 2023-07-24T16:14:52Z) (isArchived))) ((node (owner (login . wpilibsuite)) (name . desktop-common) (defaultBranchRef (prefix . refs/heads/) (name . master)) (url . https://github.com/wpilibsuite/desktop-common) (updatedAt . 2023-07-13T17:45:57Z) (isArchived . t))) ((node (owner (login . wpilibsuite)) (name . java-installer) (defaultBranchRef (prefix . refs/heads/) (name . master)) (url . https://github.com/wpilibsuite/java-installer) (updatedAt . 2023-06-22T17:03:11Z) (isArchived . t))) ((node (owner (login . wpilibsuite)) (name . thirdparty-apriltag) (defaultBranchRef (prefix . refs/heads/) (name . main)) (url . https://github.com/wpilibsuite/thirdparty-apriltag) (updatedAt . 2023-06-10T14:39:57Z) (isArchived))) ((node (owner (login . wpilibsuite)) (name . thirdparty-protobuf) (defaultBranchRef (prefix . refs/heads/) (name . main)) (url . https://github.com/wpilibsuite/thirdparty-protobuf) (updatedAt . 2023-06-08T06:38:24Z) (isArchived))) ((node (owner (login . wpilibsuite)) (name . thirdparty-flatbuffers) (defaultBranchRef (prefix . refs/heads/) (name . main)) (url . https://github.com/wpilibsuite/thirdparty-flatbuffers) (updatedAt . 2023-06-07T06:09:11Z) (isArchived . t))) ((node (owner (login . wpilibsuite)) (name . import-signing-certificate) (defaultBranchRef (prefix . refs/heads/) (name . main)) (url . https://github.com/wpilibsuite/import-signing-certificate) (updatedAt . 2023-05-23T21:11:18Z) (isArchived))) ((node (owner (login . wpilibsuite)) (name . vendor-template) (defaultBranchRef (prefix . refs/heads/) (name . 2024)) (url . https://github.com/wpilibsuite/vendor-template) (updatedAt . 2023-05-11T11:36:57Z) (isArchived))) ((node (owner (login . wpilibsuite)) (name . ntcore) (defaultBranchRef (prefix . refs/heads/) (name . master)) (url . https://github.com/wpilibsuite/ntcore) (updatedAt . 2023-05-07T15:08:43Z) (isArchived . t))) ((node (owner (login . wpilibsuite)) (name . NetworkTablesClients) (defaultBranchRef (prefix . refs/heads/) (name . main)) (url . https://github.com/wpilibsuite/NetworkTablesClients) (updatedAt . 2023-04-08T23:11:11Z) (isArchived))) ((node (owner (login . wpilibsuite)) (name . WPILibInstaller) (defaultBranchRef (prefix . refs/heads/) (name . master)) (url . https://github.com/wpilibsuite/WPILibInstaller) (updatedAt . 2023-03-09T23:09:53Z) (isArchived . t))) ((node (owner (login . wpilibsuite)) (name . sphinxext-photofinish) (defaultBranchRef (prefix . refs/heads/) (name . main)) (url . https://github.com/wpilibsuite/sphinxext-photofinish) (updatedAt . 2023-02-15T20:15:48Z) (isArchived))) ((node (owner (login . wpilibsuite)) (name . DetectCoral) (defaultBranchRef (prefix . refs/heads/) (name . main)) (url . https://github.com/wpilibsuite/DetectCoral) (updatedAt . 2023-02-14T07:41:14Z) (isArchived))) ((node (owner (login . wpilibsuite)) (name . SmartDashboard) (defaultBranchRef (prefix . refs/heads/) (name . main)) (url . https://github.com/wpilibsuite/SmartDashboard) (updatedAt . 2023-02-11T16:21:53Z) (isArchived))) ((node (owner (login . wpilibsuite)) (name . StandaloneAppSamples) (defaultBranchRef (prefix . refs/heads/) (name . main)) (url . https://github.com/wpilibsuite/StandaloneAppSamples) (updatedAt . 2023-02-04T04:38:50Z) (isArchived))) ((node (owner (login . wpilibsuite)) (name . ohnoyoudidnt) (defaultBranchRef (prefix . refs/heads/) (name . main)) (url . https://github.com/wpilibsuite/ohnoyoudidnt) (updatedAt . 2023-02-03T20:45:07Z) (isArchived))) ((node (owner (login . wpilibsuite)) (name . nivision) (defaultBranchRef (prefix . refs/heads/) (name . master)) (url . https://github.com/wpilibsuite/nivision) (updatedAt . 2023-02-02T16:31:40Z) (isArchived . t))) ((node (owner (login . wpilibsuite)) (name . thirdparty-fonts) (defaultBranchRef (prefix . refs/heads/) (name . main)) (url . https://github.com/wpilibsuite/thirdparty-fonts) (updatedAt . 2023-02-01T15:37:21Z) (isArchived))) ((node (owner (login . wpilibsuite)) (name . thirdparty-uvw) (defaultBranchRef (prefix . refs/heads/) (name . master)) (url . https://github.com/wpilibsuite/thirdparty-uvw) (updatedAt . 2023-01-28T20:29:36Z) (isArchived . t))) ((node (owner (login . wpilibsuite)) (name . roborio-ant-tasks) (defaultBranchRef (prefix . refs/heads/) (name . master)) (url . https://github.com/wpilibsuite/roborio-ant-tasks) (updatedAt . 2023-01-28T20:29:35Z) (isArchived . t))) ((node (owner (login . wpilibsuite)) (name . zulu-jre-ipk) (defaultBranchRef (prefix . refs/heads/) (name . master)) (url . https://github.com/wpilibsuite/zulu-jre-ipk) (updatedAt . 2023-01-28T20:29:35Z) (isArchived . t))) ((node (owner (login . wpilibsuite)) (name . sfx-livewindow) (defaultBranchRef (prefix . refs/heads/) (name . master)) (url . https://github.com/wpilibsuite/sfx-livewindow) (updatedAt . 2023-01-28T20:29:34Z) (isArchived . t))) ((node (owner (login . wpilibsuite)) (name . sfxlib) (defaultBranchRef (prefix . refs/heads/) (name . master)) (url . https://github.com/wpilibsuite/sfxlib) (updatedAt . 2023-01-28T20:29:34Z) (isArchived . t))) ((node (owner (login . wpilibsuite)) (name . sfxmeta) (defaultBranchRef (prefix . refs/heads/) (name . master)) (url . https://github.com/wpilibsuite/sfxmeta) (updatedAt . 2023-01-28T20:29:34Z) (isArchived . t))) ((node (owner (login . wpilibsuite)) (name . sfx) (defaultBranchRef (prefix . refs/heads/) (name . master)) (url . https://github.com/wpilibsuite/sfx) (updatedAt . 2023-01-28T20:29:34Z) (isArchived . t))) ((node (owner (login . wpilibsuite)) (name . CANJaguar) (defaultBranchRef (prefix . refs/heads/) (name . master)) (url . https://github.com/wpilibsuite/CANJaguar) (updatedAt . 2023-01-28T20:29:34Z) (isArchived . t))) ((node (owner (login . wpilibsuite)) (name . wpiutil) (defaultBranchRef (prefix . refs/heads/) (name . master)) (url . https://github.com/wpilibsuite/wpiutil) (updatedAt . 2023-01-28T20:21:15Z) (isArchived . t))) ((node (owner (login . wpilibsuite)) (name . netconsole-host) (defaultBranchRef (prefix . refs/heads/) (name . master)) (url . https://github.com/wpilibsuite/netconsole-host) (updatedAt . 2023-01-28T20:21:14Z) (isArchived . t))) ((node (owner (login . wpilibsuite)) (name . EclipsePlugins) (defaultBranchRef (prefix . refs/heads/) (name . master)) (url . https://github.com/wpilibsuite/EclipsePlugins) (updatedAt . 2023-01-28T20:21:14Z) (isArchived . t))) ((node (owner (login . wpilibsuite)) (name . VisionBuildSamples) (defaultBranchRef (prefix . refs/heads/) (name . master)) (url . https://github.com/wpilibsuite/VisionBuildSamples) (updatedAt . 2023-01-28T19:17:09Z) (isArchived . t))) ((node (owner (login . wpilibsuite)) (name . opencv-build-tools) (defaultBranchRef (prefix . refs/heads/) (name . master)) (url . https://github.com/wpilibsuite/opencv-build-tools) (updatedAt . 2023-01-28T18:52:07Z) (isArchived . t))) ((node (owner (login . wpilibsuite)) (name . aarch64-bionic-cross-ubuntu) (defaultBranchRef (prefix . refs/heads/) (name . master)) (url . https://github.com/wpilibsuite/aarch64-bionic-cross-ubuntu) (updatedAt . 2023-01-28T17:57:29Z) (isArchived . t))) ((node (owner (login . wpilibsuite)) (name . raspbian-cross-ubuntu) (defaultBranchRef (prefix . refs/heads/) (name . master)) (url . https://github.com/wpilibsuite/raspbian-cross-ubuntu) (updatedAt . 2023-01-28T17:57:28Z) (isArchived . t))) ((node (owner (login . wpilibsuite)) (name . roborio-cross-ubuntu) (defaultBranchRef (prefix . refs/heads/) (name . 2020)) (url . https://github.com/wpilibsuite/roborio-cross-ubuntu) (updatedAt . 2023-01-28T17:57:28Z) (isArchived . t))) ((node (owner (login . wpilibsuite)) (name . roboRIOVisionExamples) (defaultBranchRef (prefix . refs/heads/) (name . master)) (url . https://github.com/wpilibsuite/roboRIOVisionExamples) (updatedAt . 2023-01-28T15:22:45Z) (isArchived . t))) ((node (owner (login . wpilibsuite)) (name . sphinxext-tabs) (defaultBranchRef (prefix . refs/heads/) (name . master)) (url . https://github.com/wpilibsuite/sphinxext-tabs) (updatedAt . 2023-01-28T13:12:08Z) (isArchived . t))) ((node (owner (login . wpilibsuite)) (name . toolchain-builder) (defaultBranchRef (prefix . refs/heads/) (name . 2019)) (url . https://github.com/wpilibsuite/toolchain-builder) (updatedAt . 2023-01-28T12:43:10Z) (isArchived . t))) ((node (owner (login . wpilibsuite)) (name . supervisely) (defaultBranchRef (prefix . refs/heads/) (name . master)) (url . https://github.com/wpilibsuite/supervisely) (updatedAt . 2023-01-28T12:14:01Z) (isArchived . t))) ((node (owner (login . wpilibsuite)) (name . RemotePublish) (defaultBranchRef (prefix . refs/heads/) (name . master)) (url . https://github.com/wpilibsuite/RemotePublish) (updatedAt . 2023-01-28T12:13:58Z) (isArchived . t))) ((node (owner (login . wpilibsuite)) (name . riolog) (defaultBranchRef (prefix . refs/heads/) (name . master)) (url . https://github.com/wpilibsuite/riolog) (updatedAt . 2023-01-28T12:13:57Z) (isArchived . t))) ((node (owner (login . wpilibsuite)) (name . DocumentationBuilder) (defaultBranchRef (prefix . refs/heads/) (name . master)) (url . https://github.com/wpilibsuite/DocumentationBuilder) (updatedAt . 2023-01-28T12:13:57Z) (isArchived . t))) ((node (owner (login . wpilibsuite)) (name . SmartDashboard-Extensions) (defaultBranchRef (prefix . refs/heads/) (name . master)) (url . https://github.com/wpilibsuite/SmartDashboard-Extensions) (updatedAt . 2023-01-28T12:13:57Z) (isArchived . t))) ((node (owner (login . wpilibsuite)) (name . design-docs) (defaultBranchRef (prefix . refs/heads/) (name . master)) (url . https://github.com/wpilibsuite/design-docs) (updatedAt . 2023-01-28T12:13:57Z) (isArchived . t))) ((node (owner (login . wpilibsuite)) (name . frc-openjdk-windows) (defaultBranchRef (prefix . refs/heads/) (name . master)) (url . https://github.com/wpilibsuite/frc-openjdk-windows) (updatedAt . 2023-01-28T12:04:31Z) (isArchived . t))) ((node (owner (login . wpilibsuite)) (name . raspbian-openjdk) (defaultBranchRef (prefix . refs/heads/) (name . master)) (url . https://github.com/wpilibsuite/raspbian-openjdk) (updatedAt . 2023-01-28T10:49:33Z) (isArchived . t))) ((node (owner (login . wpilibsuite)) (name . aarch64-xenial-toolchain) (defaultBranchRef (prefix . refs/heads/) (name . main)) (url . https://github.com/wpilibsuite/aarch64-xenial-toolchain) (updatedAt . 2023-01-28T06:28:33Z) (isArchived . t))) ((node (owner (login . wpilibsuite)) (name . WPILibBuilder) (defaultBranchRef (prefix . refs/heads/) (name . master)) (url . https://github.com/wpilibsuite/WPILibBuilder) (updatedAt . 2023-01-28T05:51:56Z) (isArchived . t))) ((node (owner (login . wpilibsuite)) (name . OutlineViewer) (defaultBranchRef (prefix . refs/heads/) (name . main)) (url . https://github.com/wpilibsuite/OutlineViewer) (updatedAt . 2023-01-28T04:39:37Z) (isArchived . t))) ((node (owner (login . wpilibsuite)) (name . wpimath) (defaultBranchRef (prefix . refs/heads/) (name . master)) (url . https://github.com/wpilibsuite/wpimath) (updatedAt . 2023-01-28T04:36:29Z) (isArchived . t))) ((node (owner (login . wpilibsuite)) (name . packages-testing) (defaultBranchRef (prefix . refs/heads/) (name . master)) (url . https://github.com/wpilibsuite/packages-testing) (updatedAt . 2023-01-28T04:36:17Z) (isArchived . t))) ((node (owner (login . wpilibsuite)) (name . roborio-toolchain) (defaultBranchRef (prefix . refs/heads/) (name . 2022)) (url . https://github.com/wpilibsuite/roborio-toolchain) (updatedAt . 2023-01-27T20:15:34Z) (isArchived . t))) ((node (owner (login . wpilibsuite)) (name . aarch64-bionic-toolchain) (defaultBranchRef (prefix . refs/heads/) (name . main)) (url . https://github.com/wpilibsuite/aarch64-bionic-toolchain) (updatedAt . 2023-01-27T20:15:34Z) (isArchived . t))) ((node (owner (login . wpilibsuite)) (name . raspbian-toolchain) (defaultBranchRef (prefix . refs/heads/) (name . main)) (url . https://github.com/wpilibsuite/raspbian-toolchain) (updatedAt . 2023-01-27T20:15:34Z) (isArchived . t))) ((node (owner (login . wpilibsuite)) (name . Axon) (defaultBranchRef (prefix . refs/heads/) (name . main)) (url . https://github.com/wpilibsuite/Axon) (updatedAt . 2023-01-21T22:12:06Z) (isArchived))) ((node (owner (login . wpilibsuite)) (name . opensdk) (defaultBranchRef (prefix . refs/heads/) (name . main)) (url . https://github.com/wpilibsuite/opensdk) (updatedAt . 2023-01-09T22:06:26Z) (isArchived))) ((node (owner (login . wpilibsuite)) (name . thirdparty-imgui) (defaultBranchRef (prefix . refs/heads/) (name . main)) (url . https://github.com/wpilibsuite/thirdparty-imgui) (updatedAt . 2022-11-28T01:07:00Z) (isArchived))) ((node (owner (login . wpilibsuite)) (name . wpilib-ws-robot) (defaultBranchRef (prefix . refs/heads/) (name . main)) (url . https://github.com/wpilibsuite/wpilib-ws-robot) (updatedAt . 2022-11-18T01:11:18Z) (isArchived))) ((node (owner (login . wpilibsuite)) (name . wpilib-version-plugin) (defaultBranchRef (prefix . refs/heads/) (name . master)) (url . https://github.com/wpilibsuite/wpilib-version-plugin) (updatedAt . 2022-11-08T16:19:08Z) (isArchived))) ((node (owner (login . wpilibsuite)) (name . thirdparty-libssh) (defaultBranchRef (prefix . refs/heads/) (name . main)) (url . https://github.com/wpilibsuite/thirdparty-libssh) (updatedAt . 2022-10-24T17:38:48Z) (isArchived))) ((node (owner (login . wpilibsuite)) (name . sphinxext-presentations) (defaultBranchRef (prefix . refs/heads/) (name . main)) (url . https://github.com/wpilibsuite/sphinxext-presentations) (updatedAt . 2022-09-23T04:30:31Z) (isArchived))) ((node (owner (login . wpilibsuite)) (name . .github) (defaultBranchRef (prefix . refs/heads/) (name . master)) (url . https://github.com/wpilibsuite/.github) (updatedAt . 2022-08-05T17:28:24Z) (isArchived))) ((node (owner (login . wpilibsuite)) (name . sphinxext-delta) (defaultBranchRef (prefix . refs/heads/) (name . main)) (url . https://github.com/wpilibsuite/sphinxext-delta) (updatedAt . 2022-01-24T17:06:58Z) (isArchived)))))) |

Filter the results, generate XML

#+name: wpilibsuite
#+begin_src emacs-lisp :var gqldata=wpi-repos :results value html
(thread-first
  (thread-last
    (a-get* (nthcdr 0 gqldata) 'data 'organization 'repositories 'edges)
    (mapcar (lambda (el) (a-get* el 'node)))
    (seq-filter (lambda (el) (not (a-get* el 'isArchived))))
    (mapcar (lambda (el)
              (let* (;; (defaultBranchRef (a-get* 'defaultBranchRef))
                     (path (a-get* el 'name))
                     (ref (concat (a-get* el 'defaultBranchRef 'prefix)
                                  (a-get* el 'defaultBranchRef 'name)))
                     (name (string-join (list (a-get* el 'owner 'login)
                                              (a-get* el 'name)) "/")))
                (concat "<project"
                        " name=\"" name
                        "\" path=\"" path
                        "\" revision=\"" ref "\" remote=\"github\"/>")))))
  (cl-sort 'string-lessp :key 'downcase)
  (string-join "\n"))
#+end_src

** Generate XML

Generate =wpilibsuite.xml=

#+begin_src xml :tangle wpilibsuite.xml :noweb yes
<?xml version="1.0" encoding="utf-8"?>
<manifest>
  <<wpilibsuite()>>
</manifest>
#+end_src
